brew "neovim"
brew "lazygit"
#brew "clangd"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zoxide"
brew "zsh"
brew "yazi"
#brew "ranger"
brew "tmux"
brew "tree"
brew "gh"
brew "llvm" # clang
brew "unzip"
brew "zip"
brew "npm"
brew "dotnet"
brew "starship"
brew "eza"
brew "zoxide"
brew "maven"
brew "lua"




cask "font-geist-mono-nerd-font" 
cask "font-jetbrains-mono-nerd-font" 
cask "google-chrome"
cask "discord"
cask "alt-tab"
cask "alacritty"
cask "ghostty"
cask "zen-browser"
cask "macs-fan-control"
