
brew "bat"
brew "docker"
brew "gcc"
brew "ffmpeg"
brew "go"
brew "mysql"
brew "mysql@8.0"
brew "neofetch"
brew "neovim"
brew "node"
brew "bun"
brew "openjdk"
brew "openvpn"
brew "putty"
brew "python@3.11"
brew "rust"
brew "starship"
brew "tmux"
brew "tree"
brew "lazygit"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zoxide"
brew "zsh"
brew "yazi"
brew "gh"
brew "llvm"
brew "unzip"
brew "zip"
brew "npm"
brew "dotnet"
brew "eza"
brew "maven"
brew "lua"
brew "cmake"
brew "croc"
brew "make"
brew "raylib"
brew "sdl2"
brew "fzf"

cask "alacritty"
cask "alt-tab"
cask "dotnet-sdk"
cask "obsidian"
cask "tidal"
cask "visual-studio-code"
cask "ghostty"
cask "cursor"
cask "1password"
cask "firefox"
cask "google-chrome"
cask "vivaldi"
cask "zen"

cask "font-fira-code"
cask "font-geist-mono-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-fira-code-nerd-font"

# Linux (arch-linux/install.sh): mariadb ≈ mysql + mysql@8.0; neofetch → AUR neofetch.
# python@3.11: install.sh includes `uv` — run `uv python install 3.11` (no AUR compile). alt-tab cask is macOS-only.
