brew "neovim"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# GNU compiler collection
brew "gcc"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql@8.0"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Implementation of Telnet and SSH
brew "putty"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Safe, concurrent, practical language
brew "rust"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# GPU-accelerated terminal emulator
cask "alacritty"
# Enable Windows-like alt-tab
cask "alt-tab"
# Chromium based browser
cask "arc"
# Voice and text chat software
cask "discord"
# Developer platform
cask "dotnet-sdk"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Developer targeted fonts with a high number of glyphs
cask "font-geist-mono-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# GPU-based terminal emulator
cask "kitty"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Desktop virtualization software
cask "parallels"
# Remote desktop
cask "parsec"
# Collaboration platform for API development
cask "postman"
# SSH client
cask "termius"
# Music streaming service with high fidelity sound and hi-def video quality
cask "tidal"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark"
brew "lazygit"
#brew "clangd"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zoxide"
brew "zsh"
brew "yazi"
#brew "ranger"
brew "tmux"
brew "tree"
brew "gh"
brew "llvm" # clang
brew "unzip"
brew "zip"
brew "npm"
brew "dotnet"
brew "starship"
brew "eza"
brew "zoxide"
brew "maven"
brew "lua"
brew "cmake"
brew "make"
brew "raylib"
brew "sdl2"


cask "font-geist-mono-nerd-font" 
cask "font-jetbrains-mono-nerd-font" 
cask "google-chrome"
cask "discord"
cask "alt-tab"
cask "alacritty"
cask "ghostty"
cask "zen-browser"
cask "macs-fan-control"
cask "cursor"
cask "visual-studio-code"
cask "1password"
cask "obsidian"
cask ""
